<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#处理缺失值" data-toc-modified-id="处理缺失值-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>处理缺失值</a></span><ul class="toc-item"><li><span><a href="#过滤缺失值" data-toc-modified-id="过滤缺失值-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>过滤缺失值</a></span></li><li><span><a href="#补全缺失值" data-toc-modified-id="补全缺失值-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>补全缺失值</a></span></li></ul></li><li><span><a href="#数据转换" data-toc-modified-id="数据转换-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>数据转换</a></span><ul class="toc-item"><li><span><a href="#删除重复值" data-toc-modified-id="删除重复值-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>删除重复值</a></span></li><li><span><a href="#使用函数或映射进行数据转换" data-toc-modified-id="使用函数或映射进行数据转换-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>使用函数或映射进行数据转换</a></span></li><li><span><a href="#替代值-replace" data-toc-modified-id="替代值-replace-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>替代值 replace</a></span></li><li><span><a href="#重命名轴索引-.index.map()-&amp;.rename()" data-toc-modified-id="重命名轴索引-.index.map()-&amp;.rename()-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>重命名轴索引 .index.map() &amp;.rename()</a></span></li><li><span><a href="#离散化和分箱-pd.cut" data-toc-modified-id="离散化和分箱-pd.cut-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>离散化和分箱 pd.cut</a></span></li><li><span><a href="#检测和过滤异常值" data-toc-modified-id="检测和过滤异常值-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>检测和过滤异常值</a></span></li><li><span><a href="#置换和随机抽样--df.take(sampler)-|-df.sample()" data-toc-modified-id="置换和随机抽样--df.take(sampler)-|-df.sample()-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>置换和随机抽样--df.take(sampler) | df.sample()</a></span></li><li><span><a href="#计算指标/虚拟变量--get_dummies函数" data-toc-modified-id="计算指标/虚拟变量--get_dummies函数-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>计算指标/虚拟变量--get_dummies函数</a></span></li></ul></li><li><span><a href="#字符串操作" data-toc-modified-id="字符串操作-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>字符串操作</a></span><ul class="toc-item"><li><span><a href="#字符串对象方法" data-toc-modified-id="字符串对象方法-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>字符串对象方法</a></span></li><li><span><a href="#正则表达式" data-toc-modified-id="正则表达式-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>正则表达式</a></span></li><li><span><a href="#pandas中的向量化字符串方法" data-toc-modified-id="pandas中的向量化字符串方法-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>pandas中的向量化字符串方法</a></span></li></ul></li></ul></div>

# 处理缺失值
* 标示值: pandas使用浮点值NaN

* 处理缺失值相关函数:

函数|描述
-|-
dropna|根据每个标签是否确实数据来筛选轴标签,并确定阈值
fillna|用某些值填充缺失数据或使用插值方法(ffill,bfill)
isnull
notnull

In [5]:
import pandas as pd

## 过滤缺失值
dropna方法

In [12]:
from numpy import nan as NA

Series

In [9]:
data = pd.Series(['aardas',NA ,'dsf',NA,'dadf'])
data

0    aardas
1       NaN
2       dsf
3       NaN
4      dadf
dtype: object

In [10]:
data.dropna()

0    aardas
2       dsf
4      dadf
dtype: object

DataFrame
how参数,默认有NAN则去除行

In [14]:
data = pd.DataFrame([[1,3,4],['d',3,NA],[2,NA,NA],[NA,NA,NA]])
data

     0    1    2
0    1  3.0  4.0
1    d  3.0  NaN
2    2  NaN  NaN
3  NaN  NaN  NaN

In [16]:
cleaned = data.dropna(how = 'all')
cleaned

   0    1    2
0  1  3.0  4.0
1  d  3.0  NaN
2  2  NaN  NaN

## 补全缺失值
fillna()方法

In [18]:
data.fillna({1:0,2:0.5})

     0    1    2
0    1  3.0  4.0
1    d  3.0  0.5
2    2  0.0  0.5
3  NaN  0.0  0.5

# 数据转换

## 删除重复值
duplicated()方法: 反映该处是否存在重复情况  
drop_duplicates()

In [20]:
data = pd.DataFrame({'k1': ['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [23]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

## 使用函数或映射进行数据转换
Series的map()方法: 接收包含函数或映射关系的字典对象并进行转换

## 替代值 replace

In [24]:
data = pd.Series(np.arange(16))
data

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
dtype: int32

In [33]:
data.replace({0:np.nan, 1:0}).replace([2,3,4,5],1)

0      NaN
1      0.0
2      1.0
3      1.0
4      1.0
5      1.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
11    11.0
12    12.0
13    13.0
14    14.0
15    15.0
dtype: float64

## 重命名轴索引 .index.map() &.rename()

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [37]:
transform = lambda x: x[:4].upper()

In [38]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [51]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [52]:
data.rename(index = str.title,columns=str.upper )

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [53]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

## 离散化和分箱 pd.cut
qcut(): equal length

In [55]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [56]:
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [60]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [62]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

## 检测和过滤异常值

In [88]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028426    -0.020400    -0.012559     0.020961
std       0.994699     1.009003     1.016161     0.978526
min      -3.131452    -3.358962    -3.942827    -2.728730
25%      -0.686933    -0.705657    -0.737973    -0.663103
50%      -0.029750    -0.004787     0.012385     0.035524
75%       0.663433     0.680836     0.708613     0.670067
max       2.846046     3.118576     2.898317     3.791754

In [89]:
col = data[2]
col[np.abs(col)>3]

261   -3.056211
791   -3.015332
978   -3.942827
Name: 2, dtype: float64

In [90]:
# show all row contains number bigger than 3 beyond all 
# restrict the value between -3 and 3

In [91]:
# any() method
data[(np.abs(data)>3).any(1)]

            0         1         2         3
23  -3.131452 -0.207169 -1.631110  0.944845
261  1.423656  1.370657 -3.056211 -0.857803
595  1.337915 -0.631207  0.005209  3.791754
658  0.502757 -3.358962  0.599356 -0.825905
747 -0.434840 -3.244673 -1.322634 -0.890066
791  1.643958 -2.057355 -3.015332 -0.274438
830 -0.801013  3.118576 -1.043855  1.068736
978 -0.472325 -1.460881 -3.942827  1.020895

In [92]:
# restrict the value between -3 and 3
data[(np.abs(data)>3)] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028294    -0.019915    -0.011545     0.020169
std       0.994297     1.006761     1.012730     0.975789
min      -3.000000    -3.000000    -3.000000    -2.728730
25%      -0.686933    -0.705657    -0.737973    -0.663103
50%      -0.029750    -0.004787     0.012385     0.035524
75%       0.663433     0.680836     0.708613     0.670067
max       2.846046     3.000000     2.898317     3.000000

In [107]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0  1.0 -1.0  1.0

## 置换和随机抽样--df.take(sampler) | df.sample()
* df.take(sampler)
* df.sample() 产生不含有替代值的随机子集,replace=true时带有替代值的样本(可以重复选)

In [108]:
df = pd.DataFrame(np.arange(20).reshape(5,4))
sampler = np.random.permutation(5)
sampler

array([3, 0, 1, 4, 2])

In [105]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [106]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [113]:
df.sample(2)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3

## 计算指标/虚拟变量--get_dummies函数

In [115]:
# show the list of all different genres
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

D:\Program_python\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: read_table is deprecated, use read_csv instead.
  after removing the cwd from sys.path.
D:\Program_python\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [117]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [125]:
zero_matrix = np.zeros((len(movies),len(genres)))
dummies = pd.DataFrame(zero_matrix,columns=genres) # generate a matrix using genres as columns

gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [126]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [127]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices]=1

In [130]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0:3]

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [134]:
# use get_dummies and cut() 
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [135]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 字符串操作
## 字符串对象方法
python 内建字符串方法:

方法|描述
-|-
split()|split string
.join()| 使用字符串作为间隔符
in关键字|检测子字符串
.index() /.find()|返回开始位置
.count()|出现次数
endswith|是否以后缀结尾
startswith|是否以前缀开始
rfind
replace|使用字符串代替另一个字符串
strip,rstrip,lstrip|修建空白,去除空格回车,对每个字符使用
lower|
upper
casefold|转换为小写可比较形式
ljust,rjust|左对齐或右对齐

In [136]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [137]:
pieces = [x.strip() for x in val.split(',')] # 清楚空格
pieces

['a', 'b', 'guido']

In [140]:
'::'.join(pieces)
# equal to:
# first, secend, third = pieces
# first+'::'+secend+'::'+third

'a::b::guido'

In [142]:
'a' in val

True

## 正则表达式
re module:模式匹配,替代,拆分  
s+ 描述一个或多个空白字符的正则   
re.compile() 编译,**形成可复用的正则表达式对象**,节省cpu  
re.sub() 替换
**正则表达式方法:**
方法|描述
-|-
findall|显示所有匹配项
finditer|类似findall,但返回迭代器
match|起始位置匹配模式
split|根据模式,拆分成多个部分
sub,subn|替换表达式中的匹配

In [143]:
import re
text = 'foo   bar\t baz \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [145]:
# 编译,形成可复用的正则表达式对象
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [146]:
regex.findall(text)

['   ', '\t ', ' \t']

In [158]:
# 查找电子邮件
text = """sun 112@qq.com
Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [156]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['112@qq.com',
 'dave@google.com',
 'steve@gmail.com',
 'rob@gmail.com',
 'ryan@yahoo.com']

In [160]:
# add '(,)' and use groups() to return tuple
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

[('112', 'qq', 'com'),
 ('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

## pandas中的向量化字符串方法

向量化字符串方法

方法|描述
-|-
cat|根据分隔符按元素粘合字符串
contains|返回是否含某个模式或正则的布尔值数组
count
extract|抽取的一个或多个字符串,返回每个分组形成一列的DataFrame
endswith
startswith
findall
get|对每个元素进行索引,获得第i个元素
isalnum | 等价于内建的str.alnum
isalhpa| 等价于内建的 ... 
isdecimal | ...
isdigit
islower
isnumeric
isupper
join
len
lower,upper
match
pad|将空白加到字符串左,右或者两边
center|等价于pad(side='both')
repeat|重复次数
replace
slice
split
strip
rstrip
lstrip

In [168]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [163]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [ ]:
# if contains 'gmail'

In [164]:
# str.contains() 
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [165]:
# redex method
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [167]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object